## [DataFrame에 행/열 추가]

(1) 모듈 로딩 <hr>

In [40]:
import pandas as pd

(2) 데이터 준비 <hr>

In [41]:
# dict 타입의 데이터 생성
exam={'이름':['김','이','박','조','전'],
       '국어': [90,60,40,39,84],
       '수학': [80,30,40,20,35],
       '사회': [30,35,49,97,45],
       '과학': [47,60,30,65,87],
       '체육': [90,70,60,59,99]}

(3) DataFrame에 데이터 저장 <hr>

In [42]:
examDF=pd.DataFrame(exam)

In [43]:
examDF

  이름  국어  수학  사회  과학  체육
0  김  90  80  30  47  90
1  이  60  30  35  60  70
2  박  40  40  49  30  60
3  조  39  20  97  65  59
4  전  84  35  45  87  99

(4) 저장된 데이터 속성 확인 <hr>

In [44]:
def printAttribute(df,dfname):
    print(f'[{dfname} Attributes]')
    print(f'index\n ==> {df.index}')
    print(f'columns\n ==> {df.columns}')
    print(f'shape\n ==> {df.shape}')
    print(f'ndim\n ==> {df.ndim}')
    print(f'size\n ==> {df.size}')
    print(f'dtypes\n ==> {df.dtypes}')

In [45]:
printAttribute(examDF, 'examDF')

[examDF Attributes]
index
 ==> RangeIndex(start=0, stop=5, step=1)
columns
 ==> Index(['이름', '국어', '수학', '사회', '과학', '체육'], dtype='object')
shape
 ==> (5, 6)
ndim
 ==> 2
size
 ==> 30
dtypes
 ==> 이름    object
국어     int64
수학     int64
사회     int64
과학     int64
체육     int64
dtype: object

(5) DataFrame에 컬럼(column)추가 <hr>

- 방법 : DF객체변수명[새로운 컬럼명]=값

In [46]:
examDF.columns

Index(['이름', '국어', '수학', '사회', '과학', '체육'], dtype='object')

In [47]:
# 행 개수 만큼 값 추가
examDF['영어']=[90,80,70,60,50]

In [48]:
examDF

  이름  국어  수학  사회  과학  체육  영어
0  김  90  80  30  47  90  90
1  이  60  30  35  60  70  80
2  박  40  40  49  30  60  70
3  조  39  20  97  65  59  60
4  전  84  35  45  87  99  50

In [49]:
# 1개의 데이터 즉 값 추가 시 모든 행에 동일 값으로 저장
examDF['과학']=10

In [50]:
examDF

  이름  국어  수학  사회  과학  체육  영어
0  김  90  80  30  10  90  90
1  이  60  30  35  10  70  80
2  박  40  40  49  10  60  70
3  조  39  20  97  10  59  60
4  전  84  35  45  10  99  50

In [51]:
# 1개의 데이터 즉 값 추가 시 모든 행에 동일 값으로 저장
examDF[7]=0

In [52]:
examDF

  이름  국어  수학  사회  과학  체육  영어  7
0  김  90  80  30  10  90  90  0
1  이  60  30  35  10  70  80  0
2  박  40  40  49  10  60  70  0
3  조  39  20  97  10  59  60  0
4  전  84  35  45  10  99  50  0

In [53]:
examDF.columns

Index(['이름', '국어', '수학', '사회', '과학', '체육', '영어', 7], dtype='object')

(6) DataFrame에 행(row) 추가 <hr>
- 방법 : DF객체변수명.loc[새로운 행인덱스] = [컬럼수 만큼 데이터]
- 방법 : DF객체변수명.loc[새로운 행인덱스] = 데이터
- 불가 방법 : DF객체변수명.iloc[새로운 행인덱스] = 데이터 => 데이터 존재해야지 인덱스 할당됨

In [54]:
examDF.index

RangeIndex(start=0, stop=5, step=1)

In [55]:
# 컬럼 수 만큼의 데이터를 가진 행 추가
examDF.loc[5]=['원더우먼', 100,100,100,100,100,100,100]

In [56]:
examDF

     이름   국어   수학   사회   과학   체육   영어    7
0     김   90   80   30   10   90   90    0
1     이   60   30   35   10   70   80    0
2     박   40   40   49   10   60   70    0
3     조   39   20   97   10   59   60    0
4     전   84   35   45   10   99   50    0
5  원더우먼  100  100  100  100  100  100  100

In [57]:
# 행 추가 시 iloc는 사용불가 => why? 데이터 수에 맞게 인덱스 범위 지정이 되기 때문에
# 현재 인덱스에 없는 인덱스로 불가
#examDF.iloc[6]=['슈퍼맨', 100,100,100,100,100,100,100]

In [58]:
# 1개 데이터 가진 행 추가
examDF.loc[6]='슈퍼맨'

In [59]:
examDF

     이름   국어   수학   사회   과학   체육   영어    7
0     김   90   80   30   10   90   90    0
1     이   60   30   35   10   70   80    0
2     박   40   40   49   10   60   70    0
3     조   39   20   97   10   59   60    0
4     전   84   35   45   10   99   50    0
5  원더우먼  100  100  100  100  100  100  100
6   슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨  슈퍼맨